/* Задача 1.
 Напишите условие, которое будет проверять чётное ли число, используйте оператор if.

 Задача 2.
 1. Объявите переменную age с числовым значением.
 2. С помощью тернарного оператора (вложенного, если нужно) присвойте переменной discount значение скидки:
    2.1. Если age меньше 18 – скидка 10%.
    2.2. Если age от 18 до 65 (включительно) – скидка 20%.
    2.3. Если age больше 65 – скидка 30%.
 3. Выведите значение discount в консоль.
 4. *Дополнительное задание: перепишите задачу на switch-case.

 Задача 3.
 1. Объявите переменные username и password.
    Допустимые варианты имени пользователя — это "admin" или "user", а пароль должен быть равен "123456".2. Если выполняется условие:
     (username равен "admin" или "user") и пароль равен "123456"
     то выведите сообщение "Доступ разрешен", иначе — "Доступ запрещен".
 3. Используйте prompt для ввода имени пользователя и пароля.

 *Задача 4.
 Создайте программу, которая рассчитывает стоимость доставки посылки, основываясь на весе и типе доставки. Программа должна запрашивать у пользователя данные с помощью prompt и выводить результат через alert.

 1. Ввод данных:
    1.1. Запросите у пользователя вес посылки (в килограммах).
    1.2. Запросите у пользователя тип доставки. Допустимые варианты:
        "Стандарт"
        "Премиум"

 2. Проверка корректности данных:
    2.1. Если вес меньше или равен 0, выведите сообщение об ошибке: "Некорректный вес посылки".
    2.2. Если введён тип доставки, который не соответствует ни одному из ожидаемых вариантов, выведите сообщение: "Неверный тип доставки".

 3. Расчёт базовой стоимости доставки:
    3.1. Определите базовую стоимость в зависимости от веса посылки:
        Если вес меньше 1 кг, базовая стоимость — 5$.
        Если вес от 1 кг до 5 кг (включительно), базовая стоимость — 10$.
        Если вес больше 5 кг, базовая стоимость — 15$.

    Для определения базовой стоимости можно использовать конструкцию if...else или тернарный оператор.

 4. Определение коэффициента по типу доставки:
     Используйте конструкцию switch-case для назначения коэффициента:
        "Стандарт": коэффициент 1
        "Экспресс": коэффициент 1.5
        "Премиум": коэффициент 2

 5. Расчёт итоговой стоимости доставки:
    Итоговая стоимость = базовая стоимость * коэффициент.

 6. Вывод результата:
    С помощью alert выведите итоговую стоимость доставки, например: "Итоговая стоимость доставки: 15$."
*/

// Задача 1________________________________________________________________________________

var num = Number(prompt("Введите число:"), 0);

if (isNaN(num)) {
  alert("Это не число!");
} else if (num % 2 === 0) {
  // делится на 2 без остатка
  console.log("Число четное");
} else {
  console.log("Число нечетное");
}

// покороче - если одна инструкция в фигурных скобках, то можно их не писать; если инструкций больше - надо
// let num = +prompt("Введите число для проверки:");

// if (isNaN(num)) console.log("Это не число!");
// else if (num % 2 === 0) console.log("Число четное");
// else console.log("Число нечетное");

// Задача 2_________________________________________________________________________________
var age = 35;
var discount = age < 18 ? "10%" : age <= 65 ? "20%" : "30%"; // двоеточие - аналог else/else if
console.log(`Ваша скидка: ${discount}`);

// switch/case
// let age = 35;
// let discount;

// switch (true) {
//   case age < 18:
//     discount = "10%";
//     break;
//   case age >= 18 && age <= 65:
//     discount = "20%";
//     break;
//   default:
//     discount = "30%";
// }

// console.log(`Ваша скидка: ${discount}`);

// Задача 3_________________________________________________________________________________
var username = prompt("Введите имя пользователя:");
var password = prompt("Введите пароль:");
if ((username == "admin" || username == "user") && password == "123456")
  console.log("Доступ разрешен");
else console.log("Доступ запрещен");

// с фигурными скобками

// let username = prompt("Введите имя пользователя:");
// let password = prompt("Введите пароль:");
// if ((username === "admin" || username === "user") && password === "123456") {
//   alert("Доступ разрешен");
// } else {
//   alert("Доступ запрещен");
// }

// Задача 4_________________________________________________________________________________
// 1) Ввод данных
let weight = +prompt("Введите вес посылки (в кг):");
let deliveryType = prompt("Выберите тип доставки: Стандарт,Премиум");

// 2) Проверка корректности данных
if (weight <= 0) alert("Некорректный вес посылки");
else {
  // 3) Расчёт базовой стоимости доставки
  let baseValue = weight < 1 ? 5 : weight <= 5 ? 10 : 15;

  // 4) Тип доставки
  let rate;
  let isValidDeliveryType = true;

  switch (deliveryType) {
    case "Стандарт":
      rate = 1;
      break;
    case "Экспресс":
      rate = 1.5;
      break;
    case "Премиум":
      rate = 2;
      break;
    default:
      isValidDeliveryType = false;
      alert("Неверный тип доставки");
  }

  // 5) Расчёт итоговой стоимости и 6) Вывод результата
  if (isValidDeliveryType) {
    let totalValue = baseValue * rate;
    alert(`Итоговая стоимость доставки: ${totalValue}$.`);
  }
}
